[
    {
        "firstName": "anthony",
        "secondName": "devis",
        "playerName": "Anthony Devis",
        "description": "Anthony Marshon Davis Jr. (born March 11,1993), nicknamed AD, is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association (NBA). He previously played for the New Orleans Pelicans. He plays the power forward and center positions. Davis is a nine-time NBA All-Star and has been named to four All-NBA First Teams and five NBA All-Defensive Teams. In his first season with the Lakers, he won the 2020 NBA Finals. In 2021, he was named to the NBA 75th Anniversary Team. He also won the inaugural NBA Cup in 2023 with the Lakers. Davis is widely regarded as one of the greatest power forwards of all time. Davis played one season of college basketball for the Kentucky Wildcats, when he was first team All-American and the Consensus National Player of the Year. He also won the USBWA National Freshman of the Year, NABC Defensive Player of the Year and the Pete Newell Big Man Award. Davis led the NCAA in blocks and set Southeastern Conference and NCAA Division I freshman single-season blocked shots records. He led Kentucky to a national championship and was named the most outstanding player of the 2012 NCAA Division.",
        "shortInfo": "Player of the week | week 24",
        "price": 10,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2FFs0DYT5WYAA52sE.jpg?alt=media&token=fcf4612c-3b4c-4a5f-bc41-a69d70a10c55",
        "imageName": "Fs0DYT5WYAA52sE.jpg",
        "imageHash": "d7abf09668102f4c19a675ecd3928e2d86e7a5a1c48181a1fd38c24197a2353d",
        "cardUserId": "2",
        "author": "asd"
    },
    {
        "firstName": "lebron",
        "secondName": "james",
        "playerName": "Lebron James",
        "description": "LeBron Raymone James Sr. (/ləˈbrɒn dʒeɪmz/;[1] lə-BRON; born December 30, 1984) is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association (NBA). Nicknamed King James, he is widely recognized as one of the greatest players in the history of the sport and is often compared to Michael Jordan in debates regarding who is the greatest basketball player of all time.[a] James has competed in 10 NBA Finals (with eight consecutive appearances from 2011 to 2018), winning four NBA championships.[2] He also won the inaugural NBA Cup in 2023 with the Lakers, and two Olympic gold medals as a member of the U.S. men's national team.Individually, James is the all-time leading scorer in NBA history and ranks fourth in career assists, has won four Most Valuable Player (MVP) Awards, four Finals MVP Awards, three All-Star Game MVP Awards, and was named the inaugural NBA Cup MVP. He has been named an All-Star a record 20 times, selected to the All-NBA Team 20 times (including 13 First Team selections)[3][4] and the All-Defensive Team six times, and was a runner-up for the NBA Defensive Player of the Year Award twice in his career.[5][6] Noted for ",
        "shortInfo": "Player of the week | week 12",
        "price": 12.5,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2FFmDuLs8WIAUEohZ.jpg?alt=media&token=fbc0f014-f914-45d5-90d1-834381034ad2",
        "imageName": "FmDuLs8WIAUEohZ.jpg",
        "imageHash": "cce10f9f75843c05ec335379686980153de861e20d296085971cd64be20daa10",
        "cardUserId": "3",
        "author": "Stavri"
    },
    {
        "firstName": "kevin",
        "secondName": "durant",
        "playerName": "Kevin Durant",
        "description": "Kevin Wayne Durant (/dəˈrænt/ də-RANT; born September 29, 1988), also known by his initials KD, is an American professional basketball player for the Phoenix Suns of the National Basketball Association (NBA). Widely regarded as one of the greatest players in NBA history,[1][2][3][4] Durant has won two NBA championships, an NBA Most Valuable Player Award, two Finals MVP Awards, two NBA All-Star Game Most Valuable Player Awards, four NBA scoring titles, the NBA Rookie of the Year Award, been named to 11 All-NBA teams (including six First Teams), and selected 14 times as an NBA All-Star. In 2021, Durant was named to the NBA 75th Anniversary Team.[5] As a member of the U.S. men's national team, Durant has won three gold medals in the Olympics (2012, 2016, and 2020) and is the leading scorer in Team USA's men's Olympic basketball history. He also won gold at the 2010 FIBA World Championship.Durant was a heavily recruited high school prospect widely regarded as the second-best player in his class. He played one season of college basketball for the Texas Longhorns, where he won numerous year-end awards and became the first freshman to be named Naismith College Player of the Year. Durant",
        "shortInfo": "Player of the week | week 7",
        "price": 10.5,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2FFjPcre-XgAESysn.jpg?alt=media&token=48884272-c823-49e0-8127-8fd6d3b46027",
        "imageName": "FjPcre-XgAESysn.jpg",
        "imageHash": "769ef4356f84d52b467dce79dd770fc475496dcd7d8379747839dccf0bb6006f",
        "cardUserId": "3",
        "author": "Stavri"
    },
    {
        "firstName": "luka",
        "secondName": "doncic",
        "playerName": "luka dončić",
        "description": "Luka Dončić (/ˈluːkə ˈdɒntʃɪtʃ/ LOO-kə DON-chitch;[1] Slovene: [ˈlùːka ˈdòːntʃitʃ]; born February 28, 1999) is a Slovenian professional basketball player for the Dallas Mavericks of the National Basketball Association (NBA). Nicknamed Luka Magic,[2] he also plays for the Slovenia national team and is regarded as one of the greatest European players of all time.[3][4][5][6][7]Born in Ljubljana, Dončić shone as a youth player for Union Olimpija before joining the youth academy of Real Madrid. In 2015, he made his debut for the academy's senior team at age 16, becoming the youngest in club history. He made his senior debut for Slovenia in 2016 at only 17 years of age. He later helped his country win its first EuroBasket title, in 2017, while also being named to the All-Tournament Team. Dončić led Madrid to the 2018 EuroLeague title, winning the EuroLeague MVP and the Final Four MVP. He was named the ACB Most Valuable Player and won back-to-back EuroLeague Rising Star and ACB Best Young Player awards. Dončić was also selected to the EuroLeague 2010–20 All-Decade Team.[8]",
        "shortInfo": "Player of the week | week 17",
        "price": 9.5,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2FFLlYyOVXIAQDuAb.jpg?alt=media&token=febfdcfa-13cf-4270-8601-2160eed85299",
        "imageName": "FLlYyOVXIAQDuAb.jpg",
        "imageHash": "faff1f7205196bb3b457d1dc52c79b0ce8b7672926c634b67b163d9790cf7004",
        "cardUserId": "2",
        "author": "asd"
    },
    {
        "firstName": "julius",
        "secondName": "randle",
        "playerName": "julius randle",
        "description": "Julius Deion Randle (born November 29, 1994) is an American professional basketball player for the New York Knicks of the National Basketball Association (NBA). A three-time NBA All-Star and a two-time member of the All-NBA Team, he was awarded the NBA Most Improved Player Award in 2021.In his only season of college basketball with the Kentucky Wildcats, Randle was named a third-team All-American. He was drafted by the Los Angeles Lakers in the first round of the 2014 NBA draft with the seventh overall pick. In his regular season debut, Randle broke his right leg and missed the remainder of his rookie season. After four years with the Lakers, he signed with the New Orleans Pelicans before joining the Knicks after one season.",
        "shortInfo": "Player of the week | week 20",
        "price": 12,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2Fjulius%20randle.jpg?alt=media&token=b0bf63d0-777f-437b-ade8-83a8e55ff115",
        "imageName": "julius randle.jpg",
        "imageHash": "8ee56224b54c41fc93607cf348264f8859a1e7318e01e5f30a3c6c2cd32cd172",
        "cardUserId": "2",
        "author": "asd"
    },
    {
        "firstName": "giannis",
        "secondName": "antetokounmpo",
        "playerName": "giannis antetokounmpo",
        "description": "Giannis Sina Ugo Antetokounmpo[a] (born Adetokunbo;[b] December 6, 1994) is a Greek and Nigerian professional basketball player for the Milwaukee Bucks of the National Basketball Association (NBA). His size, speed, strength, and country of origin have earned him the nickname Greek Freak. He is widely regarded as one of the greatest power forwards of all time as well as one of the greatest players of all time.Born and raised in Athens to Nigerian parents, Antetokounmpo began playing basketball for the youth teams of Filathlitikos in Athens. In 2011, he began playing for the club's senior team before entering the 2013 NBA draft, where he was selected 15th overall by the Bucks. In 2016–17, he led the Bucks in all five major statistical categories and became the first player in NBA history to finish a regular season in the top 20 in all five statistics: total points, rebounds, assists, steals, and blocks.He received the Most Improved Player award in 2017. Antetokounmpo has received eight All-Star selections, including being selected as an All-Star captain in 2019,2020,2023 and 2024 as he led the Eastern Conference in voting in these four years.",
        "shortInfo": "Player of the week | week 6",
        "price": 15,
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/nba-player-cards-dev-fbc78.appspot.com/o/images%2Fnba-cards%2FGianisAntetokounmpo.JPG?alt=media&token=5333d6ca-f544-4036-9685-03876cf07dbd",
        "imageName": "GianisAntetokounmpo.JPG",
        "imageHash": "aaa5afe3ae76173f2d5ed26bcb1436ad260bf761662f24e5562d2bb00aae0d56",
        "cardUserId": "3",
        "author": "Stavri"
    }
]